# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Elisp Examples

say hello

#+begin_src emacs-lisp
(message "Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!

Deactivate promp before every execution:

#+begin_src elisp
(setq org-confirm-babel-evaluate t)
#+end_src

#+RESULTS:
: t

If and function

#+begin_src emacs-lisp
(defun foo (x) (if x 1 0))
(list (foo t) (foo nil))

#+end_src

#+RESULTS:
| 1 | 0 |

#+begin_src elisp
  (defvar a (if (eq (getenv "HOME") nil) 0 1))
  (* a 100)
#+end_src

#+RESULTS:
: 100

#+begin_src elisp
  (let ((a 4) (b 3)) (* a 100 b))
#+end_src

#+RESULTS:
: 1200
